TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0C1106/driverlib/empty_driverlib_src/ti/driverlib/dl_aesadv.h
    return (DL_AESADV_IIDX)(eventIIDX);
}

/**
 *  @brief      Clear pending DMA input trigger event
 *
 *  @param[in]  aesadv      Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_AESADV_clearDMAInputTriggerEventStatus(
    AESADV_Regs *aesadv)
{
    aesadv->DMA_TRIG_DATAIN.ICLR = DL_AESADV_EVENT_DMA_DATA_INPUT_TRIGGER;
}

/**
 *  @brief      Clear pending DMA output trigger event
 *
 *  @param[in]  aesadv      Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_AESADV_clearDMAOutputTriggerEventStatus(
    AESADV_Regs *aesadv)
{
    aesadv->DMA_TRIG_DATAOUT.ICLR = DL_AESADV_EVENT_DMA_DATA_OUTPUT_TRIGGER;
}

/**
 *  @brief Returns the address of the AESADV input data register.
 *
 *  This API can be used with @ref DL_DMA_setDestAddr to set the destination
 *  address when using DMA transfers. The Data should be written as 128-bit
 *  block writes (4 32-bit words) to a region of memory starting at the provided
 *  address.
 *      Use with the @ref DL_AESADV_enableDMAOperation
 *      The DMA output request use @ref DL_AESADV_EVENT_DMA_DATA_OUTPUT_TRIGGER
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *
 *  @return Address of the AESADV input data register
 *
 *  @sa DL_AESADV_enableDMAOperation
 */
__STATIC_INLINE uintptr_t DL_AESADV_getDATAINAddr(const AESADV_Regs *aesadv)
{
    return ((uintptr_t) &aesadv->DATA0);
}

/**
 *  @brief Returns the address of the AESADV output data register.
 *
 *  This API can be used with @ref DL_DMA_setDestAddr to set the destination
 *  address when using DMA transfers. The Data should be read as 128-bit
 *  block read (4 32-bit words) to a region of memory starting at the provided
 *  address.
 *      Use with the @ref DL_AESADV_enableDMAOperation
 *      The DMA output request use @ref DL_AESADV_EVENT_DMA_DATA_OUTPUT_TRIGGER
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *
 *  @return Address of the AESADV output data register
 *
 *  @sa DL_AESADV_enableDMAOperation
 */
__STATIC_INLINE uintptr_t DL_AESADV_getDATAOUTAddr(const AESADV_Regs *aesadv)
{
    return ((uintptr_t) &aesadv->DATA0);
}

/**
 *  @brief Initializes the engine in the Electronic Codebook (ECB) mode
 *
 *  This function is designed to place the engine in Electronic Codebook (ECB)
 *  mode with all necessary control context.
 *      The primary key, however, must be set into the AES engine before this
 *  function is called. This is because the key could come from either the
 *  KEYSTORECTL or from plaintext depending on system setting.
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *  @param[in] config       Pointer to configuration struct with valid values
 *                          for: direction, lowerCryptoLength, upperCryptoLength
 *
 *  @sa DL_AESADV_setKey
 */
void DL_AESADV_initECB(AESADV_Regs *aesadv, const DL_AESADV_Config *config);

/**
 *  @brief Initializes the engine in the Cipher-Block Chaining (CBC) mode
 *
 *  This function is designed to place the engine in Cipher Block Chaining (CBC)
 *  mode with all necessary control context.
 *      The primary key, however, must be set into the AES engine before this
 *  function is called. This is because the key could come from either the
 *  KEYSTORECTL or from plaintext depending on system setting.
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *  @param[in] config       Pointer to configuration struct with valid values
 *                          for: direction, iv, lowerCryptoLength,
 *                               upperCryptoLength
 *
 *  @sa DL_AESADV_setKey
 */
void DL_AESADV_initCBC(AESADV_Regs *aesadv, const DL_AESADV_Config *config);

/**
 *  @brief Initializes the engine in the Cipher Feedback (CFB) mode
 *
 *  This function is designed to place the engine in Cipher Feedback (CFB) mode
 *  with all necessary control context.
 *      The primary key, however, must be set into the AES engine before this
 *  function is called. This is because the key could come from either the
 *  KEYSTORECTL or from plaintext depending on system setting.
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *  @param[in] config       Pointer to configuration struct with valid values
 *                          for: direction, iv, lowerCryptoLength, upperCryptoLength,
 *                               cfb_fbWidth
 *
 *  @sa DL_AESADV_setKey
 */
void DL_AESADV_initCFB(AESADV_Regs *aesadv, const DL_AESADV_Config *config);

/**
 *  @brief Initializes the engine in the Output Feedback (OFB) mode
 *
 *  This function is designed to place the engine in Output Feedback (OFB) mode
 *  with all necessary control context.
 *      The primary key, however, must be set into the AES engine before this
 *  function is called. This is because the key could come from either the
 *  KEYSTORECTL or from plaintext depending on system setting.
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *  @param[in] config       Pointer to configuration struct with valid values
 *                          for: direction, iv, lowerCryptoLength,
 *                               upperCryptoLength
 *
 *  @sa DL_AESADV_setKey
 */
void DL_AESADV_initOFB(AESADV_Regs *aesadv, const DL_AESADV_Config *config);

/**
 *  @brief Initializes the engine in the Counter (CTR) mode
 *
 *  This function is designed to place the engine in Counter (CTR) mode with all
 *  necessary control context.
 *      The primary key, however, must be set into the AES engine before this
 *  function is called. This is because the key could come from either the
 *  KEYSTORECTL or from plaintext depending on system setting.
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *  @param[in] config       Pointer to configuration struct with valid values
 *                          for: direction iv, lowerCryptoLength,
 *                               upperCryptoLength, ctr_ctrWidth. IV is
 *                               typically 0x00000001
 *
 *  @sa DL_AESADV_setKey
 */
void DL_AESADV_initCTR(AESADV_Regs *aesadv, const DL_AESADV_Config *config);

/**
 *  @brief Initializes the engine in the Integer Counter Mode (ICM)
 *
 *  This function is designed to place the engine in Integer Counter Mode (ICM)
 *  with all necessary control context. ICM is a variant of CTR mode with a 16-
 *  bit wide counter value.
 *      The primary key, however, must be set into the AES engine before this
 *  function is called. This is because the key could come from either the
 *  KEYSTORECTL or from plaintext depending on system setting.
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *  @param[in] config       Pointer to configuration struct with valid values
 *                          for: direction iv, lowerCryptoLength,
 *                               upperCryptoLength. IV is typically 0x00000001
 *
 *  @sa DL_AESADV_setKey
 */
void DL_AESADV_initICM(AESADV_Regs *aesadv, const DL_AESADV_Config *config);

/**
 *  @brief Initializes the engine in the block cipher-based Message
 *         Authentication Code (CMAC)
 *
 *  This function is designed to place the engine in block cipher-based Message
 *  Authentication Code: CMAC. CMAC is strictly authentication and does not
 *  generate any ciphertext or plaintext, but only a tag. CMAC is also
 *  recommended by NIST in SP 800-38B for authentication. It consists of a
 *  primary key as well as derived keys K1 and K2 which must be provided in
 *  the configuration. The engine will not derive K1 and K2, and these must be
 *  calculated beforehand and included in the config struct.
 *      The primary key from which K1 and K2 are derived, however, must be set
 *  in the AES engine before this function is called. This is because the key
 *  could come from either the KEYSTORECTL or from plaintext depending on
 *  system setting.
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *  @param[in] config       Pointer to configuration struct with valid values
 *                          for: K1, K2, lowerCryptoLength, upperCryptoLength.
 *
 *  @sa DL_AESADV_setKey
 */
void DL_AESADV_initCMAC(AESADV_Regs *aesadv, const DL_AESADV_Config *config);

/**
 *  @brief Initializes the engine in the Cipher Block Chaining Message
 *         Authenication Code (CBC-MAC)
 *
 *  This function is designed to place the engine in Cipher Block Chaining
 *  Message Authenication Code (CBC-MAC). CBC-MAC is strictly authentication and
 *  does not generate any ciphertext or plaintext, but only a tag.
 *      The primary key, however, must be set into the AES engine before this
 *  function is called. This is because the key could come from either the
 *  KEYSTORECTL or from plaintext depending on system setting.
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *  @param[in] config       Pointer to configuration struct with valid values
 *                          for: lowerCryptoLength, upperCryptoLength.
 *
 *  @sa DL_AESADV_setKey
 */
void DL_AESADV_initCBCMAC(AESADV_Regs *aesadv, const DL_AESADV_Config *config);

/**
 *  @brief Initializes the engine in the Galois/Counter Mode (GCM)
 *
 *  This function is designed to place the engine in Galois/Counter Mode (GCM).
 *  GCM is both authentication and data encryption, and will generate both
 *  ciphertext/plaintext and the corresponding tag.
 *      The primary key and hash key (if expected from @ref DL_AESADV_MODE) must
 *  be set into the AES engine before this function is called. This is because
 *  the key could come from either the KEYSTORECTL or from plaintext depending
 *  on system setting.
 *      After this function has completed, the user is to first input all
 *  additional authentication data (AAD) before entering the crypto payload.
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *  @param[in] config       Pointer to configuration struct with valid values
 *                          for: mode (one of the GCM operations), direction,
 *                               iv, lowerCryptoLength, upperCryptoLength,
 *                               aadLength. IV is
 *                               typically 0x00000001. The maximum length in
 *                               bytes is 2^36 - 32.
 *
 *  @sa DL_AESADV_setKey
 *  @sa DL_AESADV_setHashKey
 */
void DL_AESADV_initGCM(AESADV_Regs *aesadv, const DL_AESADV_Config *config);

/**
 *  @brief Initializes the engine in the Counter & CBC-MAC (CCM)mode
 *
 *  This function is designed to place the engine in Counter and Cipher-Block
 *  Chaining Message Authentication Code (CCM) mode.
 *  CCM is both authentication and data encryption, and will generate both
 *  ciphertext/plaintext and the corresponding tag.
 *      To calculate the length of the nonce and the counter width, please refer
 *  to @ref DL_AESADV_loadCCMNonceAndCounter.
 *      After this function has completed, the user is to first input all
 *  additional authentication data (AAD) before entering the crypto payload.
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *  @param[in] config       Pointer to configuration struct with valid values
 *                          for: direction, nonce, ccm_ctrWidth, ccm_tagWidth,
 *                               lowerCryptoLength, upperCryptoLength, aadLength
 *                               IV is typically 0x00000001. The maximum AAD
 *                               Length is 2^16-2^8
 *
 *  @sa DL_AESADV_setKey
 */
void DL_AESADV_initCCM(AESADV_Regs *aesadv, DL_AESADV_Config *config);

#ifdef __cplusplus
}
#endif

#endif /* __MSPM0_HAS_AESADV__ */

#endif /* ti_dl_dl_aesadv__include */
/** @}*/
